<?php
  $x = 10;
  $y = 20;
  echo $x + $y . '<br>';
  echo $x - $y . '<br>';
  echo $x * $y . '<br>';
  echo $x / $y . '<br>';
  echo $x % $y . '<br>';

  $x +=  10; // x + 10 = 20
  $y -= 5; // y - 5 = 15
  $x++; // x + 1 = 21
  $x--; // x - 1 = 20
  echo $x . '<br>';

  echo M_PI . '<br>';
  echo M_E . '<br>';

  echo abs(-22) . '<br>';
  echo ceil(0.33) . '<br>'; // округление в большую сторону
  echo floor(0.89) . '<br>'; // округление в меньшую сторону
  echo round(0.5, 1) . '<br>'; // округление до ближайшего целого

  // є всі функції для роботи з числами, той ж самий синус або косинус, логарифм, степінь і так далі

  $rand = mt_rand(1, 100); // випадкове число від 1 до 100
  echo $rand . '<br>';

  echo max(3, 5, 1) . '<br>';
  echo min(3, 5, 1) . '<br>';
?>